Revit 2024 API
ParameterTypeId.ProjectRevisionSequenceNum Property
 "Revision Sequence": read_only Make this read-only again when NewSchedules_DisplayTags is cleaned up
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ProjectRevisionSequenceNum { get; }
Visual Basic
Public Shared ReadOnly Property ProjectRevisionSequenceNum As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ProjectRevisionSequenceNum {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace